"""
평균 점수 구하기

국어 = 80
영어 = 75
수학 = 55

평균 = (국어 + 영어 + 수학) / 3
print(평균)
"""

"""
홀, 짝 구분

if (13 % 2 == 0):
    print("짝수")
else:
    print("홀수")
"""


""" 
슬라이싱

번호 = "881120-1068234"
print("{0}, {1}".format(번호[:6], 번호[7:])) 
"""


""" 
인덱싱

pin = "881120-1068234"
print(pin[7])
"""

""" 
치환

a = "a:b:c:d"
print(a.replace(":", "#"))
"""

"""
내림차순 정렬

a = [1, 3, 5, 4, 2]
a.sort()
a.reverse()
print(a)
"""

"""
리스트 문자열 변환

a = ['Life', 'is', 'too', 'short']
print(" ".join(a))
"""

""" 
튜플 더하기

a = (1, 2, 3)
print(a + tuple([4]))
"""

"""
Dictionary 값 추출


a = {'A': 90, 'B': 80, 'C': 70}
print(a['B'])
"""

"""
리스트 중복 숫자 제거

a = [1, 1, 1, 2, 2, 3, 3, 3, 4, 4, 5]
print(list(set(a)))
"""
